public class 메모 {
    
}
/*
이클립스는 포트번호 8080을 사용한다.


6개월 수업은 이렇게 진행(순차적으로 익히면서 발전. 쉽지만 갈수록 복잡해진다.)
sevlet      자바 코드들 사이에 HTML을 끼워넣는 방식의 웹페이지 작성  (불편하고 유지보수가 힘듬)
jsp         HTML 사이에 자바 코드들을 끼워넣는 방식의 웹페이지 작성 (sevlet보다 편해졌다.)
spring
spring boot



GET과 POST 전송방식



Sevlet 서블릿(렛) : Server Applet의 줄임말
 이전에는 CGI가 있었는데, CGI의 단점을 보완하기 위해 SUN이라는 회사에서 개발한
 자바 기반의 웹 프로그래밍 솔루션이다. 이 서블릿을 기반으로 JSP가 개발되었다.
 JSP도 사실은 내부적으로는 서블릿으로 변환되어 수행된다.
 따라서 서블릿의 구성이나 동작방식을 이해하는 것이 JSP를 이해하는데 많은 도움이 될 것이다.

 서블릿은 자바코드 안에 HTML을 넣어서 구성하는 방식이고 (서블릿은 가독성이 너무 안좋다. 자바도 안좋은데)
 JSP는 반대로 HTML안에 자바코드를 넣어서 구성한다.













*/